Autodesk.Revit.DB.Mechanical.ZoneEquipment.GetAssociatedZoneEquipment(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
Gets the associated zone equipment of all specified analytical spaces.
document:
The document where the analytical spaces and zone equipment exist.
spaces:
The specified analytical spaces.
Returns:
All associated zone equipment, either explicitly assigned or implicitly assigned via system-zone.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020.1

Autodesk.Revit.DB.Mechanical.ZoneEquipment.GetAssociatedZoneEquipment(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the associated zone equipment of the specified analytical space.
document:
The document where the analytical spaces and zone equipment exist.
spaceElementId:
The specified analytical spaces.
Returns:
All associated zone equipment, either explicitly assigned or implicitly assigned via system-zone.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020.1

Autodesk.Revit.DB.Mechanical.ZoneEquipment.MoveSpaceToEquipment(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Moves the selected analytical spaces from the identified zone equipment to another target zone equipment.
document:
The document where the zone equipment and the analytical spaces exist.
analyticalSpaceSet:
The specified analytical spaces to move.
originalZoneEquipmentId:
The original equipment where the analytical spaces will be removed. If passing invalidElementId, the existing zone equipment is not removed.
targetZoneEquipmentId:
The target zone equipment where the analytical spaces will be associated. If passing invalidElementId, the analytical spaces will not be assigned to any new zone equipment.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2020.1

Autodesk.Revit.DB.Mechanical.ZoneEquipment.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new zone equipment
document:
The document where the new element will be created.
name:
The name of new zone equipment. The actual name may be post-fixed if already exists.
Returns:
The newly created zone equipment.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name cannot include prohibited characters.
-or-
name is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2020.1